Examinator/src/Catalogs/ТемыСообщенийСУО/ТемыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТемыСообщенийСУО</name>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.ОрганизаторыСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключенныеПолучатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/НастройкиТемОбщенияСУО/НастройкиТемОбщенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемОбщенияСУО</name>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиТемФорумаСУО/НастройкиТемФорумаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемФорумаСУО</name>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СообщенияТемСУО/СообщенияТемСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияТемСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РазделФорума</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>CatalogRef.УчебныеГруппыОО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиЛичныхСообщенийСУО/НастройкиЛичныхСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЛичныхСообщенийСУО</name>
  <attributes>
    <name>Удалено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ДанныеВебКабинетаСУО_ОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ТемыПользователейСУО/ТемыПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТемыПользователейСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Кому</name>
    <type>
      <types>EnumRef.АдресатыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.РазделыФорумаСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАвтор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГрупповоеОбсуждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/АдресатыСообщенийСУО/АдресатыСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АдресатыСообщенийСУО</name>
  <enumValues>
    <name>НаФоруме</name>
  </enumValues>
  <enumValues>
    <name>УчастникамМероприятия</name>
  </enumValues>
  <enumValues>
    <name>УчастникамПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>УчастникуМероприятия</name>
  </enumValues>
  <enumValues>
    <name>УчастникуПрограммыОбучения</name>
  </enumValues>
  <enumValues>
    <name>Преподавателям</name>
  </enumValues>
  <enumValues>
    <name>Преподавателю</name>
  </enumValues>
  <enumValues>
    <name>УчебнойГруппе</name>
  </enumValues>
  <enumValues>
    <name>Пользователю</name>
  </enumValues>
  <enumValues>
    <name>Администратору</name>
  </enumValues>
  <enumValues>
    <name>Организатору</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ТемыСообщенийСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция АдресатПоКонтексту(Контекст) Экспорт

	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчебнойГруппе;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчастникуПрограммыОбучения;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.Преподавателю;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчастникуМероприятия;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчастникамПрограммыОбучения;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.УчастникамМероприятия;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.Пользователю;
	КонецЕсли;

	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.РазделыФорумаСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.НаФоруме;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.ОрганизаторыСУО") Тогда
		Возврат Перечисления.АдресатыСообщенийСУО.Организатору;
	КонецЕсли;	
	
	Возврат Перечисления.АдресатыСообщенийСУО.ПустаяСсылка();
	
КонецФункции

Функция ЕдинственныйАдресат(Контекст) Экспорт

	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.УчебныеГруппыСУО") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПрохождениеПрограммыОбученияСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст, "Пользователь");
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПреподавателемОбученияСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст, "Пользователь");
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПрохождениеОбученияСУО") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контекст, "Пользователь");
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат Контекст;
	КонецЕсли;

	Если ТипЗнч(Контекст) = Тип("СправочникСсылка.РазделыФорумаСУО") Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

Процедура ЗаписатьПользовательскиеНастройкиТемы(Тема, ИмяРеквизита = Неопределено, Значение = Неопределено, Пользователь = Неопределено, ТекущаяДата = Неопределено, НеОбновлятьДанныеВебКабинета = Ложь) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Пользователь = Неопределено Тогда
			Пользователь = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		Если ТекущаяДата = Неопределено Тогда
			ТекущаяДата = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ДанныеТемы             = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Кому, Контекст");
		ЭтоГрупповоеОбсуждение = Документы.СообщениеСУО.ЭтоГрупповоеОбсуждение(ДанныеТемы.Кому);
		
		РегистрыСведений.НастройкиТемОбщенияСУО.ЗаписатьНастройки(Тема, ИмяРеквизита, Значение, Пользователь, ТекущаяДата);
		
		Если ЭтоГрупповоеОбсуждение Тогда
			
			РегистрыСведений.НастройкиТемФорумаСУО.ЗаписатьНастройки(Тема, ИмяРеквизита, Значение, Пользователь, ТекущаяДата, НеОбновлятьДанныеВебКабинета);
			
		Иначе
			
			// Записываем настройки личных сообщений
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СообщенияТемСУО.Регистратор КАК Сообщение
			|ИЗ
			|	РегистрСведений.СообщенияТемСУО КАК СообщенияТемСУО
			|ГДЕ
			|	СообщенияТемСУО.Тема = &Тема";
			
			Запрос.УстановитьПараметр("Тема", Тема);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РегистрыСведений.НастройкиЛичныхСообщенийСУО.ЗаписатьНастройки(ВыборкаДетальныеЗаписи.Сообщение,,,Пользователь,ТекущаяДата);
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция КоличествоСообщенийВТеме(Тема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СообщенияТемСУО.Регистратор) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО КАК СообщенияТемСУО
		|ГДЕ
		|	СообщенияТемСУО.Тема = &Тема";
	
	Запрос.УстановитьПараметр("Тема", Тема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат 0;
		
	Иначе
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		ВыборкаДетальныеЗаписи.Следующий();

		Возврат ВыборкаДетальныеЗаписи.КоличествоСообщений;
		
	КонецЕсли;
	
КонецФункции

// Веб-кабинет
//

Процедура ОбновитьДанныеВебКабинета(Тема, ДополнительныеДанные = Неопределено) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем данные темы
	
	ТемаОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тема, "Закрыта, Контекст, ПометкаУдаления, Автор, ДатаСоздания");
	
	// Добавляем общее описание темы
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Тема, Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщения);
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(Тема, "Справочник.ТемыСообщенийСУО");
	РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.УдалитьОтбор(Тема); 
	
	Если НЕ ТемаОбъект.ПометкаУдаления И НЕ ТемаОбъект.Закрыта И ЗначениеЗаполнено(ТемаОбъект.Контекст) Тогда
		
		// Данные темы
		
		ТемаСообщенийJSON = ТемаСообщенийJSON(Тема);
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.ТемаОбщения, Тема, ТемаСообщенийJSON, Перечисления.ФорматыВебДанныхСУ.json);
		
		// Отбор по контексту
		
		РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Тема, ТемаОбъект.Контекст);	
		
		// Отбор по пользователям
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТемыПользователейСУО.Пользователь
			|ИЗ
			|	РегистрСведений.ТемыПользователейСУО КАК ТемыПользователейСУО
			|ГДЕ
			|	ТемыПользователейСУО.Тема = &Тема";
		
		Запрос.УстановитьПараметр("Тема", Тема);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.ДобавитьОтбор(Тема, ВыборкаДетальныеЗаписи.Пользователь);
		КонецЦикла;
	
		// Зависимости
		
		Зависимости = Новый Массив;
		
		Если ТемаОбъект.ДатаСоздания + (7*24*60*60) > ТекущаяДатаСеанса() Тогда			
			
			Зависимости.Добавить(ТемаОбъект.Контекст);
			Зависимости.Добавить(ТемаОбъект.Автор);
		
			РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Тема, "Справочник.ТемыСообщенийСУО", Зависимости);
			
		КонецЕсли;
		
	КонецЕсли;	
			
КонецПроцедуры

Функция ТемаСообщенийJSON(ТемаСообщений) Экспорт
	
	ДанныеТемы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТемаСообщений, "Ссылка, Наименование, Автор, Автор.Наименование, ДатаСоздания, Контекст, Контекст.Наименование");
	
		
	ОписаниеРаздела = Новый Структура(
		"Наименование, Автор, ДатаСоздания, Идентификатор, Контекст, НаименованиеКонтекста",
		ДанныеТемы.Наименование,
		ВебКабинетСУО.ПользовательСтруктура(ДанныеТемы.Автор, ДанныеТемы.АвторНаименование),
		ДанныеТемы.ДатаСоздания,
		Строка(ДанныеТемы.Ссылка.УникальныйИдентификатор()),
		?(ЗначениеЗаполнено(ТемаСообщений.Контекст), Строка(ТемаСообщений.Контекст.УникальныйИдентификатор()), ""),
		ДанныеТемы.КонтекстНаименование
	);
	
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

Функция ТемаСообщенийОписаниеОбщееJSON(ТемаСообщений) Экспорт
	
	// ПоследнееСообщение
	
	ПоследнееСообщение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщенияТемСУОСрезПоследних.Регистратор КАК Сообщение
		|ИЗ
		|	РегистрСведений.СообщенияТемСУО.СрезПоследних(, Тема = &Тема) КАК СообщенияТемСУОСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	СообщенияТемСУОСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Тема", ТемаСообщений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ПоследнееСообщение = Документы.СообщениеСУО.СообщениеСтруктура(ВыборкаДетальныеЗаписи.Сообщение);
		
	КонецЕсли;
	
	// КоличествоСообщений	
	
	КоличествоСообщений = КоличествоСообщенийВТеме(ТемаСообщений);
	
	// Результат
	
	ОписаниеРаздела = Новый Структура("ПоследнееСообщение, КоличествоСообщений", ПоследнееСообщение, КоличествоСообщений);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

Функция ТемаФорумаОписаниеПользовательскоеJSON(ТемаФорума, Пользователь) Экспорт
	
	// ДатаПросмотра
	
	ДатаПросмотра = Дата("00010101");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТемФорумаСУО.ДатаПросмотра
		|ИЗ
		|	РегистрСведений.НастройкиТемФорумаСУО КАК НастройкиТемФорумаСУО
		|ГДЕ
		|	НастройкиТемФорумаСУО.Пользователь = &Пользователь
		|	И НастройкиТемФорумаСУО.Тема = &Тема";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Тема", ТемаФорума);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		ДатаПросмотра = ВыборкаДетальныеЗаписи.ДатаПросмотра;
		
	КонецЕсли;
		
	// Результат
	
	ОписаниеРаздела = Новый Структура("ДатаПросмотра", ДатаПросмотра);
	ОписаниеРаздела	= ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеРаздела);	
	
	Возврат ОписаниеРаздела;	
	
КонецФункции

#КонецЕсли
